ams/src/Reports/AMS_ДоговорыСКлиентами/AMS_ДоговорыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>AMS_ДоговорыСКлиентами</name>
</mdclass:Report>

ams/src/InformationRegisters/_ПриложенияКДоговорам/_ПриложенияКДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ПриложенияКДоговорам</name>
  <resources>
    <name>ДатаПолученияСкана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияОригинала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПриложения</name>
    <type>
      <types>EnumRef._ВидыПриложенийКДоговорам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Reports/AMS_ДоговорыСКлиентами/Forms/ФормаПриложений/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Договор = Параметры.Договор;
	
	НастройкаФормы();
	
	ЗаполнитьТаблицуЗначений();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабл

&НаКлиенте
Процедура ТаблДатаПолученияСканаПриИзменении(Элемент)
	ТекСтр = ТекущийЭлемент.ТекущиеДанные;
	
	Измерения = Новый Структура;
	Измерения.Вставить("Договор",      ТекСтр.Договор);	
	Измерения.Вставить("ВидПриложения",ТекСтр.ВидПриложения);	
	Измерения.Вставить("Номер",        ТекСтр.Номер);	
	Измерения.Вставить("Дата",         ТекСтр.Дата);
	
	ИзменитьПриложения(Измерения,"ДатаПолученияСкана",ТекСтр.ДатаПолученияСкана);
	
	ЗаполнитьТаблицуЗначений();
КонецПроцедуры

&НаКлиенте
Процедура ТаблДатаПолученияОригиналаПриИзменении(Элемент)
	ТекСтр = ТекущийЭлемент.ТекущиеДанные;
	
	Измерения = Новый Структура;
	Измерения.Вставить("Договор",      ТекСтр.Договор);	
	Измерения.Вставить("ВидПриложения",ТекСтр.ВидПриложения);	
	Измерения.Вставить("Номер",        ТекСтр.Номер);	
	Измерения.Вставить("Дата",         ТекСтр.Дата);
	
	ИзменитьПриложения(Измерения,"ДатаПолученияОригинала",ТекСтр.ДатаПолученияОригинала);
	
	ЗаполнитьТаблицуЗначений();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	Отказ = Ложь;
	
	ЗаписатьПриложения(Отказ);

	Если Не Отказ Тогда
		Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаФормы()
	Заголовок = "Приложения к " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"НаименованиеДляПечати");
	
	РазрешитьРедактировать = Пользователи.РолиДоступны("_Юрист,_ГлавныйБухгалтер") Или AMS_ВызовСервера.ЭтоKhors();
	РазрешитьУстановкуДаты = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_Секретарь") Или AMS_ВызовСервера.ЭтоKhors();
	
	Элементы.ТаблНомер.ТолькоПросмотр         = Не РазрешитьРедактировать;
	Элементы.ТаблДата.ТолькоПросмотр          = Не РазрешитьРедактировать;
	Элементы.ТаблВидПриложения.ТолькоПросмотр = Не РазрешитьРедактировать;
	Элементы.ТаблОписание.ТолькоПросмотр      = Не РазрешитьРедактировать;
	
	Элементы.ТаблДатаПолученияСкана.Доступность     = РазрешитьРедактировать Или РазрешитьУстановкуДаты;
	Элементы.ТаблДатаПолученияОригинала.Доступность = РазрешитьРедактировать Или РазрешитьУстановкуДаты;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗначений()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	т.ВидПриложения КАК ВидПриложения,
	|	т.Договор КАК Договор,
	|	т.Описание КАК Описание,
	|	т.ДатаПолученияСкана КАК ДатаПолученияСкана,
	|	т.ДатаПолученияОригинала КАК ДатаПолученияОригинала
	|ИЗ
	|	РегистрСведений._ПриложенияКДоговорам КАК т
	|ГДЕ
	|	т.Договор = &Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Табл.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПриложения(Отказ)
	НомерСтроки = 0;
	
	Для каждого Стр Из Табл Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если Не ЗначениеЗаполнено(Стр.Дата) Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке № " + НомерСтроки + " не заполнена Дата.",,,,Отказ);	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ВидПриложения) Тогда
			ОбщегоНазначения.СообщитьПользователю("В строке № " + НомерСтроки + " не указан Вид приложения.",,,,Отказ);	
		КонецЕсли;
	КонецЦикла;

	Если Не Отказ Тогда
		Набор = РегистрыСведений._ПриложенияКДоговорам.СоздатьНаборЗаписей();
		Набор.Отбор.Договор.Установить(Договор);
		
		Для каждого Стр Из Табл Цикл
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись,Стр);
			Запись.Договор = Договор;
		КонецЦикла;
		
		Набор.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьПриложения(Измерения,Реквизит,Значение)
	Запись = РегистрыСведений._ПриложенияКДоговорам.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(Запись, Измерения);
	
	Запись.Прочитать();
	
	Запись[Реквизит] = Значение;
	
	Запись.Записать();
КонецПроцедуры

#КонецОбласти
